Backend/app/controllers/profiles_controller.rb

  def update
    user = User.find_by_id(current_user.id)
    if user.update_attributes(profile_params)
---
SELECT  "users".* FROM "users" WHERE "users"."type" IN ('Client') AND "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "device_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["device_id", "5"], ["updated_at", 2016-09-04 21:32:46 UTC], ["id", 1]]