Backend/app/controllers/webhooks_controller.rb

INSERT INTO "webhooks" ("token", "user_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["token", "LvdaiAMMX337J9qa80aZIg"], ["user_id", 2], ["company_id", 2], ["created_at", 2016-09-04 16:25:50 UTC], ["updated_at", 2016-09-04 16:25:50 UTC]]
---
  def create
    @webhook = Webhook.create!(webhook_params.merge(user_id: current_user.id))