Backend/app/controllers/api/v1/authentication_controller.rb

  def create
    user = User.find_by_email params[:email] if params[:email].present? || nil
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jere@redtail.com"], ["LIMIT", 1]]