Backend/app/controllers/api/v1/base_controller.rb

  def set_current_user
    sign_in User.find_by auth_token: request.env["HTTP_AUTHORIZATION"] unless current_user
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" IS NULL LIMIT $1  [["LIMIT", 1]]