Backend/app/controllers/api/v1/webhooks_controller.rb

  def receive
    webhook = Webhook.find_by_token(params[:token])

    notification = Notification.create!(user_id: current_user.id,
                                        company_id: webhook.company_id,
                                        message: params[:message])

    response = IonicService.push(notification, webhook.user.device_id)
---
SELECT  "webhooks".* FROM "webhooks" WHERE "webhooks"."token" = $1 ORDER BY "webhooks"."id" ASC LIMIT $2  [["token", "jRoyaUuFBQcMk4LnOWZEVQ"], ["LIMIT", 1]]
INSERT INTO "notifications" ("user_id", "company_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["company_id", 2], ["message", "This is a test notification"], ["created_at", 2016-09-07 07:10:19 UTC], ["updated_at", 2016-09-07 07:10:19 UTC]]
UPDATE "users" SET "current_sign_in_at" = $1, "last_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["current_sign_in_at", 2016-09-09 16:23:14 UTC], ["last_sign_in_at", 2016-09-09 15:23:59 UTC], ["sign_in_count", 17], ["updated_at", 2016-09-09 16:23:14 UTC], ["id", 5]]